
import 'package:flutter/material.dart'; 


class Favlist {
  
  static final List<Map<String, dynamic>> favlist = [
    {
      'id': 'F001',
      'imageUrl': 'assets/imgs/im1.png',
      'restaurantName': 'Pasta AMA',
      'description':
          'ร้านพาสต้าสไตล์อิตาลีแท้ๆ ราคาไม่แพง ที่อยู่ กรุงเทพฯ รายละเอียดเพิ่มเติม คลิกได้เลย',
      'rating': 5.0,
      'isOpen': false,
      'showMotorcycleIcon': false,
      'details':
          '       Pasta AMA เป็นร้านอาหารอิตาเลียนที่เชี่ยวชาญด้านพาสต้าสดใหม่ ด้วยวัตถุดิบคุณภาพสูงและสูตรต้นตำรับ เมนูเด่นคือคาโบนาร่าที่เข้มข้น และเพสโต้ที่หอมกลิ่นใบโหระพาแท้ๆ บรรยากาศอบอุ่นเหมาะกับการมาทานกับครอบครัวหรือเพื่อนฝูง',
      'openingHours': "เปิดทุกวัน 08:00 น. ถึง 24:00 น.",
      'phoneNumber': "088-662-8244",
      'location':
          "503/3 ชั้น 1 ยิ้มแย้ม โฮสเทล ถ. เพชรบุรี \nแขวงถนนพญาไท เขตราชเทวี กรุงเทพมหานคร 10400",
      'menuimage': 'assets/imgs/mu1.png',
      'bannerImage': 'assets/imgs/po1.png',
    },
    
    {
      'id': 'F002',
      'imageUrl': 'assets/imgs/im2.jpg',
      'restaurantName': 'UMENOHANA นิฮอนมูระมอลล์',
      'description':
          'ร้านนี้โดดเด่นที่เมนูเต้าหู้ มาแล้วต้องลองกับฟองเต้าหู้สดที่เราต้มเองกับมือ! รายละเอียดเพิ่มเติม คลิกได้เลย',
      'rating': 3.5,
      'isOpen': true,
      'showMotorcycleIcon': true,
      'details':
          '       UMENOHANA นำเสนอประสบการณ์อาหารญี่ปุ่นแบบไคเซกิ โดยเน้นเมนูที่ทำจากเต้าหู้หลากหลายรูปแบบ ไม่ว่าจะเป็นเต้าหู้สดที่ทำเอง, เต้าหู้ทอดกรอบ, หรือเต้าหู้ในซุปใส บรรยากาศเงียบสงบสไตล์ญี่ปุ่นแท้ๆ เหมาะสำหรับผู้ที่ชื่นชอบอาหารเพื่อสุขภาพและรสชาติละเอียดอ่อน',
      'openingHours':
          "ช่วงเที่ยง:11:00 - 15:00 น. \nช่วงเย็น:18:00 - 22:00 น. ",
      'phoneNumber': "084-438-3892",
      'location':
          "Nihonmura Mall ถ. ทองหล่อ แขวงคลองตันเหนือ เขตวัฒนา กรุงเทพมหานคร 10110",
      'menuimage': 'assets/imgs/mu2.png',
      'bannerImage': 'assets/imgs/po1.png',
    },
    
    {
      'id': 'F003',
      'imageUrl': 'assets/imgs/im3.jpg',
      'restaurantName': 'Simple Day Gelato',
      'description':
          'ร้านเล็กๆสำหรับคนรักขนมหวานที่เรานำทุกเมนูโปรด ชนิดที่เรียกว่าเป็นขนมที่ต้องมีติดบ้านไว้เสมอ รายละเอียดเพิ่มเติม คลิกได้เลย',
      'rating': 2.5,
      'isOpen': true,
      'showMotorcycleIcon': true,
      'details':
          '       เป็นร้านขนมหวานรสชาตินุ่มละมุนที่ครองใจลูกค้าเป็นอย่างดี โดยมีเมนูของหวานอร่อยให้เลือกหลากหลายเมนู อาทิ Shibuya Honey Toast, เค้กช็อกโกแลต เครื่องดื่มสดชื่น บรรยากาศดี',
      'openingHours': "เวลาเปิด-ปิด: 10.00 - 20.00 น. (ปิดทุกวันพุธ)",
      'phoneNumber': "086-555-8789 ",
      'location':
          "94 ถนนราชพฤกษ์ แขวงบางระมาด เขตตลิ่งชัน กรุงเทพมหานคร 10170. ร้านอยู่ในโครงการ The Bloc ราชพฤกษ์",
      'menuimage': 'assets/imgs/mu3.png',
      'bannerImage': 'assets/imgs/po1.png',
    },
    
    {
      'id': 'F0010', 
      'imageUrl': 'assets/imgs/im10.webp',
      'restaurantName': 'สุกี้จินดา',
      'description':
          'สุกี้จินดา ร้านสุกี้หม่าล่าเสียบไม้แบบสายพาน มีทั้งแบบสุกี้น้ำ และสุกี้แห้ง คุณสามารถเลือกน้ำซุปเองได้ มีน้ำซุปหลายรสชาติ รายละเอียดเพิ่มเติม คลิกได้เลย',
      'rating': 3.0,
      'isOpen': true,
      'showMotorcycleIcon': true,
      'details':
          '       คนรักสุกี้หม่าล่า พลาดไม่ได้เด็ดขาด สุกี้จินดา มีไลน์อาหารให้เลือก มากกว่า 80+ เมนู คุณสามารถทานได้ไม่อั้นกับเวลา 1:30 ชม. (90 นาที) ในราคา 388 บาท จัดเต็มสุกี้หม่าล่า น้ำซุป น้ำจิ้ม ของหวาน ผลไม้ เครื่องดื่ม',
      'openingHours': "เปิดทุกวัน 11:00 น. ถึง 04:00 น.  ",
      'phoneNumber': "091-795-3839  ",
      'location':
          "ปากซอยลาดพร้าววังหิน 26 ถนนลาดพร้าววังหิน แขวง/เขตลาดพร้าว กรุงเทพฯ",
      'menuimage': 'assets/imgs/mu10.jpg',
      'bannerImage': 'assets/imgs/po10.jpg',
    },
    {
      'id': 'F007', 
      'imageUrl': 'assets/imgs/im7.jpg',
      'restaurantName': 'ก๋วยเตี๋ยวเรือทองสมิทธ์',
      'description':
          'ร้านก๋วยเตี๋ยวเรือเจ้าดังที่มีเอกลักษณ์เฉพาะตัว รสชาติเข้มข้น ครบเครื่อง เส้นเหนียวนุ่ม รายละเอียดเพิ่มเติม คลิกได้เลย',
      'rating': 4.5,
      'isOpen': true,
      'showMotorcycleIcon': true,
      'details':
          '       ร้านก๋วยเตี๋ยวเรือสุดพรีเมี่ยม บอกเลยว่ารสชาติก๋วยเตี๋ยวเรือของร้านนี้เข้มข้น จัดจ้าน บวกกับเนื้อคุณภาพดี ละลายในปากคือฟินที่สุดแล้วจ้าา นอกจากนี้เค้ายังมีเมนูหมูคุโรบุตะ และ กระดูกแก้ว สุดแสนอร่อยกรุบกรับ ก็เป็นอะไรที่พลาดไม่ได้นะบอกเลย!',
      'openingHours': "เปิดทุกวัน 10:00 - 22:00 น.",
      'phoneNumber': " 065-937-7386 ",
      'location':
          "518 , กรุงเทพมหานคร (ทองสมิทธ์ The Mall Lifestore Bangkae ร้านอยู่ชั้น G ใกล้กับ Gourmet) ",
      'menuimage': 'assets/imgs/mu7.jpg',
      'bannerImage': 'assets/imgs/po7.jpg',
    },
  ];
}